app/controllers/phones_controller.rb

  def index
    @phones = Phone.all
---
SELECT "phones".* FROM "phones"

  def create
    @phone = Phone.new(phone_params)

    respond_to do |format|
      if @phone.save
---
INSERT INTO "phones" ("created_at", "name", "phone", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-11 13:51:44.874724"], ["name", "wala"], ["phone", "0919991783"], ["updated_at", "2015-03-11 13:51:44.874724"]]

    def set_phone
      @phone = Phone.find(params[:id])
---
SELECT  "phones".* FROM "phones"  WHERE "phones"."id" = ? LIMIT 1  [["id", 1]]